Storeroom/fio/fio_disk/disk_xfs/log/JBOD/log_38/sdk/fio_randwrite_64k.log
test: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=28347: Sun Jul 15 07:47:55 2018
  write: IOPS=207, BW=12.0MiB/s (13.6MB/s)(1024MiB/78961msec)
    slat (nsec): min=5278, max=66566, avg=24659.33, stdev=10368.90
    clat (usec): min=634, max=1641.8k, avg=308390.30, stdev=252438.43
     lat (usec): min=665, max=1641.8k, avg=308415.33, stdev=252439.75
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   17], 10.00th=[   22], 20.00th=[   36],
     | 30.00th=[  133], 40.00th=[  205], 50.00th=[  275], 60.00th=[  351],
     | 70.00th=[  414], 80.00th=[  527], 90.00th=[  659], 95.00th=[  760],
     | 99.00th=[ 1045], 99.50th=[ 1183], 99.90th=[ 1401], 99.95th=[ 1485],
     | 99.99th=[ 1636]
   bw (  KiB/s): min=  640, max=26624, per=100.00%, avg=13506.31, stdev=5894.80, samples=154
   iops        : min=   10, max=  416, avg=211.03, stdev=92.11, samples=154
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.15%, 10=0.77%, 20=7.27%, 50=14.33%
  lat (msec)   : 100=4.48%, 250=19.47%, 500=31.37%, 750=16.83%, 1000=4.12%
  lat (msec)   : 2000=1.17%
  cpu          : usr=0.26%, sys=0.74%, ctx=15706, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,16384,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=12.0MiB/s (13.6MB/s), 12.0MiB/s-12.0MiB/s (13.6MB/s-13.6MB/s), io=1024MiB (1074MB), run=78961-78961msec

Disk stats (read/write):
  sdk: ios=0/15704, merge=0/676, ticks=0/4882657, in_queue=4883743, util=99.94%